adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
//
// Automatically generated by ipdlc.
// Edit at your own risk
//


#include "mozilla/net/PSocketProcessParent.h"
#include "mozilla/ProfilerLabels.h"
#include "mozilla/ipc/URIUtils.h"
#include "mozilla/net/SocketProcessParent.h"
#include "nsID.h"

#include "mozilla/net/PDNSRequestParent.h"
#include "mozilla/net/PSocketProcessBridgeParent.h"
#include "mozilla/PProfilerParent.h"
#include "mozilla/net/PWebrtcTCPSocketParent.h"
#include "mozilla/net/PHttpTransactionParent.h"
#include "mozilla/net/PHttpConnectionMgrParent.h"
#include "mozilla/ipc/PFileDescriptorSetParent.h"
#include "mozilla/ipc/PChildToParentStreamParent.h"
#include "mozilla/ipc/PParentToChildStreamParent.h"
#include "mozilla/net/PInputChannelThrottleQueueParent.h"
#include "mozilla/ipc/PBackgroundParent.h"
#include "mozilla/net/PAltServiceParent.h"
#include "mozilla/net/PAltSvcTransactionParent.h"
#include "mozilla/net/PTRRServiceParent.h"
#include "mozilla/net/PProxyConfigLookupParent.h"
#include "mozilla/net/PNativeDNSResolverOverrideParent.h"
#include "mozilla/PRemoteLazyInputStreamParent.h"

#include "ipc/IPCMessageUtils.h"
#include "nsIFile.h"
#include "mozilla/ipc/Endpoint.h"
#include "mozilla/ipc/ProtocolMessageUtils.h"
#include "mozilla/ipc/ProtocolUtils.h"
#include "mozilla/ipc/ShmemMessageUtils.h"
#include "mozilla/ipc/TaintingIPCUtils.h"

namespace mozilla {
namespace net {


auto PSocketProcessParent::RecvPWebrtcTCPSocketConstructor(
        PWebrtcTCPSocketParent* actor,
        const mozilla::Maybe<TabId>& tabId) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::RecvPChildToParentStreamConstructor(PChildToParentStreamParent* actor) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::RecvPAltServiceConstructor(PAltServiceParent* actor) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::RecvPProxyConfigLookupConstructor(
        PProxyConfigLookupParent* actor,
        nsIURI* aUri,
        const uint32_t& aFlags) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::RecvPFileDescriptorSetConstructor(
        PFileDescriptorSetParent* actor,
        const FileDescriptor& fd) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::RecvPDNSRequestConstructor(
        PDNSRequestParent* actor,
        const nsCString& hostName,
        const nsCString& trrServer,
        const uint16_t& type,
        const OriginAttributes& originAttributes,
        const uint32_t& flags) -> mozilla::ipc::IPCResult
{
    return IPC_OK();
}

auto PSocketProcessParent::ProcessingError(
        Result aCode,
        const char* aReason) -> void
{
}

auto PSocketProcessParent::ShouldContinueFromReplyTimeout() -> bool
{
    return true;
}

auto PSocketProcessParent::EnteredCxxStack() -> void
{
}

auto PSocketProcessParent::ExitedCxxStack() -> void
{
}

auto PSocketProcessParent::EnteredCall() -> void
{
}

auto PSocketProcessParent::ExitedCall() -> void
{
}

MOZ_IMPLICIT PSocketProcessParent::PSocketProcessParent() :
    mozilla::ipc::IToplevelProtocol("PSocketProcessParent", PSocketProcessMsgStart, mozilla::ipc::ParentSide)
{
    MOZ_COUNT_CTOR(PSocketProcessParent);
}

PSocketProcessParent::~PSocketProcessParent()
{
    MOZ_COUNT_DTOR(PSocketProcessParent);
}

auto PSocketProcessParent::ManagedPDNSRequestParent(nsTArray<PDNSRequestParent*>& aArr) const -> void
{
    mManagedPDNSRequestParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPDNSRequestParent() const -> const ManagedContainer<PDNSRequestParent>&
{
    return mManagedPDNSRequestParent;
}

auto PSocketProcessParent::ManagedPWebrtcTCPSocketParent(nsTArray<PWebrtcTCPSocketParent*>& aArr) const -> void
{
    mManagedPWebrtcTCPSocketParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPWebrtcTCPSocketParent() const -> const ManagedContainer<PWebrtcTCPSocketParent>&
{
    return mManagedPWebrtcTCPSocketParent;
}

auto PSocketProcessParent::ManagedPFileDescriptorSetParent(nsTArray<PFileDescriptorSetParent*>& aArr) const -> void
{
    mManagedPFileDescriptorSetParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPFileDescriptorSetParent() const -> const ManagedContainer<PFileDescriptorSetParent>&
{
    return mManagedPFileDescriptorSetParent;
}

auto PSocketProcessParent::ManagedPHttpTransactionParent(nsTArray<PHttpTransactionParent*>& aArr) const -> void
{
    mManagedPHttpTransactionParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPHttpTransactionParent() const -> const ManagedContainer<PHttpTransactionParent>&
{
    return mManagedPHttpTransactionParent;
}

auto PSocketProcessParent::ManagedPHttpConnectionMgrParent(nsTArray<PHttpConnectionMgrParent*>& aArr) const -> void
{
    mManagedPHttpConnectionMgrParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPHttpConnectionMgrParent() const -> const ManagedContainer<PHttpConnectionMgrParent>&
{
    return mManagedPHttpConnectionMgrParent;
}

auto PSocketProcessParent::ManagedPChildToParentStreamParent(nsTArray<PChildToParentStreamParent*>& aArr) const -> void
{
    mManagedPChildToParentStreamParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPChildToParentStreamParent() const -> const ManagedContainer<PChildToParentStreamParent>&
{
    return mManagedPChildToParentStreamParent;
}

auto PSocketProcessParent::ManagedPParentToChildStreamParent(nsTArray<PParentToChildStreamParent*>& aArr) const -> void
{
    mManagedPParentToChildStreamParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPParentToChildStreamParent() const -> const ManagedContainer<PParentToChildStreamParent>&
{
    return mManagedPParentToChildStreamParent;
}

auto PSocketProcessParent::ManagedPInputChannelThrottleQueueParent(nsTArray<PInputChannelThrottleQueueParent*>& aArr) const -> void
{
    mManagedPInputChannelThrottleQueueParent.ToArray(aArr);
}

auto PSocketProcessParent::ManagedPInputChannelThrottleQueueParent() const -> const ManagedContainer<PInputChannelThrottleQueueParent>&
{
    return mManagedPInputChannelThrottleQueueParent;
}

