adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    return true;
}

auto PSocketProcessParent::OpenPWebrtcTCPSocketEndpoint(PWebrtcTCPSocketParent* aActor) -> ManagedEndpoint<PWebrtcTCPSocketChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PWebrtcTCPSocketParent actor");
        return ManagedEndpoint<PWebrtcTCPSocketChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPWebrtcTCPSocketParent.PutEntry(aActor);

    return ManagedEndpoint<PWebrtcTCPSocketChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPWebrtcTCPSocketEndpoint(
        ManagedEndpoint<PWebrtcTCPSocketParent> aEndpoint,
        PWebrtcTCPSocketParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PWebrtcTCPSocketParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPWebrtcTCPSocketParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPFileDescriptorSetEndpoint(PFileDescriptorSetParent* aActor) -> ManagedEndpoint<PFileDescriptorSetChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PFileDescriptorSetParent actor");
        return ManagedEndpoint<PFileDescriptorSetChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPFileDescriptorSetParent.PutEntry(aActor);

    return ManagedEndpoint<PFileDescriptorSetChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPFileDescriptorSetEndpoint(
        ManagedEndpoint<PFileDescriptorSetParent> aEndpoint,
        PFileDescriptorSetParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PFileDescriptorSetParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPFileDescriptorSetParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPHttpTransactionEndpoint(PHttpTransactionParent* aActor) -> ManagedEndpoint<PHttpTransactionChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpTransactionParent actor");
        return ManagedEndpoint<PHttpTransactionChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPHttpTransactionParent.PutEntry(aActor);

    return ManagedEndpoint<PHttpTransactionChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPHttpTransactionEndpoint(
        ManagedEndpoint<PHttpTransactionParent> aEndpoint,
        PHttpTransactionParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpTransactionParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPHttpTransactionParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPHttpConnectionMgrEndpoint(PHttpConnectionMgrParent* aActor) -> ManagedEndpoint<PHttpConnectionMgrChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpConnectionMgrParent actor");
        return ManagedEndpoint<PHttpConnectionMgrChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPHttpConnectionMgrParent.PutEntry(aActor);

    return ManagedEndpoint<PHttpConnectionMgrChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPHttpConnectionMgrEndpoint(
        ManagedEndpoint<PHttpConnectionMgrParent> aEndpoint,
        PHttpConnectionMgrParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PHttpConnectionMgrParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPHttpConnectionMgrParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPChildToParentStreamEndpoint(PChildToParentStreamParent* aActor) -> ManagedEndpoint<PChildToParentStreamChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PChildToParentStreamParent actor");
        return ManagedEndpoint<PChildToParentStreamChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPChildToParentStreamParent.PutEntry(aActor);

    return ManagedEndpoint<PChildToParentStreamChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPChildToParentStreamEndpoint(
        ManagedEndpoint<PChildToParentStreamParent> aEndpoint,
        PChildToParentStreamParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PChildToParentStreamParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPChildToParentStreamParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPParentToChildStreamEndpoint(PParentToChildStreamParent* aActor) -> ManagedEndpoint<PParentToChildStreamChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PParentToChildStreamParent actor");
        return ManagedEndpoint<PParentToChildStreamChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPParentToChildStreamParent.PutEntry(aActor);

    return ManagedEndpoint<PParentToChildStreamChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPParentToChildStreamEndpoint(
        ManagedEndpoint<PParentToChildStreamParent> aEndpoint,
        PParentToChildStreamParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PParentToChildStreamParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPParentToChildStreamParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPInputChannelThrottleQueueEndpoint(PInputChannelThrottleQueueParent* aActor) -> ManagedEndpoint<PInputChannelThrottleQueueChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PInputChannelThrottleQueueParent actor");
        return ManagedEndpoint<PInputChannelThrottleQueueChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPInputChannelThrottleQueueParent.PutEntry(aActor);

    return ManagedEndpoint<PInputChannelThrottleQueueChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPInputChannelThrottleQueueEndpoint(
        ManagedEndpoint<PInputChannelThrottleQueueParent> aEndpoint,
        PInputChannelThrottleQueueParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PInputChannelThrottleQueueParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPInputChannelThrottleQueueParent.PutEntry(aActor);

