adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    return true;
}

auto PSocketProcessParent::OpenPAltServiceEndpoint(PAltServiceParent* aActor) -> ManagedEndpoint<PAltServiceChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltServiceParent actor");
        return ManagedEndpoint<PAltServiceChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPAltServiceParent.PutEntry(aActor);

    return ManagedEndpoint<PAltServiceChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPAltServiceEndpoint(
        ManagedEndpoint<PAltServiceParent> aEndpoint,
        PAltServiceParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltServiceParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPAltServiceParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPAltSvcTransactionEndpoint(PAltSvcTransactionParent* aActor) -> ManagedEndpoint<PAltSvcTransactionChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltSvcTransactionParent actor");
        return ManagedEndpoint<PAltSvcTransactionChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPAltSvcTransactionParent.PutEntry(aActor);

    return ManagedEndpoint<PAltSvcTransactionChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPAltSvcTransactionEndpoint(
        ManagedEndpoint<PAltSvcTransactionParent> aEndpoint,
        PAltSvcTransactionParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PAltSvcTransactionParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPAltSvcTransactionParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPTRRServiceEndpoint(PTRRServiceParent* aActor) -> ManagedEndpoint<PTRRServiceChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PTRRServiceParent actor");
        return ManagedEndpoint<PTRRServiceChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPTRRServiceParent.PutEntry(aActor);

    return ManagedEndpoint<PTRRServiceChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPTRRServiceEndpoint(
        ManagedEndpoint<PTRRServiceParent> aEndpoint,
        PTRRServiceParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PTRRServiceParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPTRRServiceParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPProxyConfigLookupEndpoint(PProxyConfigLookupParent* aActor) -> ManagedEndpoint<PProxyConfigLookupChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PProxyConfigLookupParent actor");
        return ManagedEndpoint<PProxyConfigLookupChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPProxyConfigLookupParent.PutEntry(aActor);

    return ManagedEndpoint<PProxyConfigLookupChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPProxyConfigLookupEndpoint(
        ManagedEndpoint<PProxyConfigLookupParent> aEndpoint,
        PProxyConfigLookupParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PProxyConfigLookupParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPProxyConfigLookupParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPNativeDNSResolverOverrideEndpoint(PNativeDNSResolverOverrideParent* aActor) -> ManagedEndpoint<PNativeDNSResolverOverrideChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PNativeDNSResolverOverrideParent actor");
        return ManagedEndpoint<PNativeDNSResolverOverrideChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPNativeDNSResolverOverrideParent.PutEntry(aActor);

    return ManagedEndpoint<PNativeDNSResolverOverrideChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPNativeDNSResolverOverrideEndpoint(
        ManagedEndpoint<PNativeDNSResolverOverrideParent> aEndpoint,
        PNativeDNSResolverOverrideParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PNativeDNSResolverOverrideParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPNativeDNSResolverOverrideParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::OpenPRemoteLazyInputStreamEndpoint(PRemoteLazyInputStreamParent* aActor) -> ManagedEndpoint<PRemoteLazyInputStreamChild>
{
    if (!aActor) {
        NS_WARNING("Cannot bind null PRemoteLazyInputStreamParent actor");
        return ManagedEndpoint<PRemoteLazyInputStreamChild>();
    }

    aActor->SetManagerAndRegister(this);
    mManagedPRemoteLazyInputStreamParent.PutEntry(aActor);

    return ManagedEndpoint<PRemoteLazyInputStreamChild>(mozilla::ipc::PrivateIPDLInterface(), aActor->Id());
}

auto PSocketProcessParent::BindPRemoteLazyInputStreamEndpoint(
        ManagedEndpoint<PRemoteLazyInputStreamParent> aEndpoint,
        PRemoteLazyInputStreamParent* aActor) -> bool
{
    MOZ_RELEASE_ASSERT(aEndpoint.ActorId(), "Invalid Endpoint!");
    if (!aActor) {
        NS_WARNING("Cannot bind null PRemoteLazyInputStreamParent actor");
        return false;
    }

    aActor->SetManagerAndRegister(this, *aEndpoint.ActorId());
    mManagedPRemoteLazyInputStreamParent.PutEntry(aActor);

    return true;
}

auto PSocketProcessParent::SendInit(const SocketPorcessInitAttributes& aAttributes) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_Init(MSG_ROUTING_CONTROL);

