adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    WriteIPDLParam(msg__, this, aAttributes);
    // Sentinel = 'aAttributes'
    (msg__)->WriteSentinel(442434697);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_Init", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendPreferenceUpdate(const Pref& pref) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_PreferenceUpdate(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, pref);
    // Sentinel = 'pref'
    (msg__)->WriteSentinel(71958958);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PreferenceUpdate", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendRequestMemoryReport(
        const uint32_t& generation,
        const bool& anonymize,
        const bool& minimizeMemoryUsage,
        const mozilla::Maybe<FileDescriptor>& DMDFile,
        mozilla::ipc::ResolveCallback<uint32_t>&& aResolve,
        mozilla::ipc::RejectCallback&& aReject) -> void
{
    IPC::Message* msg__ = PSocketProcess::Msg_RequestMemoryReport(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, generation);
    // Sentinel = 'generation'
    (msg__)->WriteSentinel(381158445);
    WriteIPDLParam(msg__, this, anonymize);
    // Sentinel = 'anonymize'
    (msg__)->WriteSentinel(321127387);
    WriteIPDLParam(msg__, this, minimizeMemoryUsage);
    // Sentinel = 'minimizeMemoryUsage'
    (msg__)->WriteSentinel(1321600977);
    WriteIPDLParam(msg__, this, DMDFile);
    // Sentinel = 'DMDFile'
    (msg__)->WriteSentinel(143983190);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_RequestMemoryReport", OTHER);

    ChannelSend(msg__, std::move(aResolve), std::move(aReject));
    return;
}

auto PSocketProcessParent::SendRequestMemoryReport(
        const uint32_t& generation,
        const bool& anonymize,
        const bool& minimizeMemoryUsage,
        const mozilla::Maybe<FileDescriptor>& DMDFile) -> RefPtr<RequestMemoryReportPromise>
{
    RefPtr<MozPromise<uint32_t, ResponseRejectReason, true>::Private> promise__ = new MozPromise<uint32_t, ResponseRejectReason, true>::Private(__func__);
    promise__->UseDirectTaskDispatch(__func__);
    SendRequestMemoryReport(std::move(generation), std::move(anonymize), std::move(minimizeMemoryUsage), std::move(DMDFile), [promise__](uint32_t&& aValue) {
        promise__->Resolve(std::move(aValue), __func__);
    }, [promise__](ResponseRejectReason&& aReason) {
        promise__->Reject(std::move(aReason), __func__);
    });
    return promise__;
}

auto PSocketProcessParent::SendSetOffline(const bool& offline) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_SetOffline(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, offline);
    // Sentinel = 'offline'
    (msg__)->WriteSentinel(194904804);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_SetOffline", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendSetConnectivity(const bool& connectivity) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_SetConnectivity(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, connectivity);
    // Sentinel = 'connectivity'
    (msg__)->WriteSentinel(548734240);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_SetConnectivity", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendInitLinuxSandbox(const mozilla::Maybe<FileDescriptor>& sandboxBroker) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_InitLinuxSandbox(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, sandboxBroker);
    // Sentinel = 'sandboxBroker'
    (msg__)->WriteSentinel(625149269);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitLinuxSandbox", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendInitSocketProcessBridgeParent(
        const ProcessId& processId,
        Endpoint<mozilla::net::PSocketProcessBridgeParent>&& endpoint) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_InitSocketProcessBridgeParent(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, processId);
    // Sentinel = 'processId'
    (msg__)->WriteSentinel(318243757);
    WriteIPDLParam(msg__, this, std::move(endpoint));
    // Sentinel = 'endpoint'
    (msg__)->WriteSentinel(251724642);




