adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitSocketProcessBridgeParent", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendInitProfiler(Endpoint<mozilla::PProfilerChild>&& aEndpoint) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_InitProfiler(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, std::move(aEndpoint));
    // Sentinel = 'aEndpoint'
    (msg__)->WriteSentinel(292225955);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_InitProfiler", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendSocketProcessTelemetryPing() -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_SocketProcessTelemetryPing(MSG_ROUTING_CONTROL);





    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_SocketProcessTelemetryPing", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendPHttpTransactionConstructor(PHttpTransactionParent* actor) -> PHttpTransactionParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PHttpTransactionParent actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPHttpTransactionParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PHttpTransactionConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PHttpTransactionConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PHttpTransactionParent constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PHttpTransactionMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessParent::SendPParentToChildStreamConstructor() -> PParentToChildStreamParent*
{
    PParentToChildStreamParent* actor = (static_cast<SocketProcessParent*>(this))->AllocPParentToChildStreamParent();
    return SendPParentToChildStreamConstructor(actor);
}

auto PSocketProcessParent::SendPParentToChildStreamConstructor(PParentToChildStreamParent* actor) -> PParentToChildStreamParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PParentToChildStreamParent actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPParentToChildStreamParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PParentToChildStreamConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PParentToChildStreamConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PParentToChildStreamParent constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PParentToChildStreamMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessParent::SendPHttpConnectionMgrConstructor(
        PHttpConnectionMgrParent* actor,
        const HttpHandlerInitArgs& aArgs) -> PHttpConnectionMgrParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PHttpConnectionMgrParent actor");
        return nullptr;
    }

