adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    actor->SetManagerAndRegister(this);
    mManagedPHttpConnectionMgrParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PHttpConnectionMgrConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, aArgs);
    // Sentinel = 'aArgs'
    (msg__)->WriteSentinel(92602863);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PHttpConnectionMgrConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PHttpConnectionMgrParent constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PHttpConnectionMgrMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessParent::SendUpdateDeviceModelId(const nsCString& aModelId) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_UpdateDeviceModelId(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aModelId);
    // Sentinel = 'aModelId'
    (msg__)->WriteSentinel(226951936);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_UpdateDeviceModelId", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendOnHttpActivityDistributorActivated(const bool& aIsActivated) -> bool
{
    IPC::Message* msg__ = PSocketProcess::Msg_OnHttpActivityDistributorActivated(MSG_ROUTING_CONTROL);

    WriteIPDLParam(msg__, this, aIsActivated);
    // Sentinel = 'aIsActivated'
    (msg__)->WriteSentinel(496501939);




    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_OnHttpActivityDistributorActivated", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendPInputChannelThrottleQueueConstructor(
        PInputChannelThrottleQueueParent* actor,
        const uint32_t& meanBytesPerSecond,
        const uint32_t& maxBytesPerSecond) -> PInputChannelThrottleQueueParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PInputChannelThrottleQueueParent actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPInputChannelThrottleQueueParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PInputChannelThrottleQueueConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, meanBytesPerSecond);
    // Sentinel = 'meanBytesPerSecond'
    (msg__)->WriteSentinel(1142097708);
    WriteIPDLParam(msg__, this, maxBytesPerSecond);
    // Sentinel = 'maxBytesPerSecond'
    (msg__)->WriteSentinel(1032193745);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PInputChannelThrottleQueueConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PInputChannelThrottleQueueParent constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PInputChannelThrottleQueueMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessParent::SendPAltSvcTransactionConstructor(
        PAltSvcTransactionParent* actor,
        const HttpConnectionInfoCloneArgs& aConnInfo,
        const uint32_t& aCaps) -> PAltSvcTransactionParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PAltSvcTransactionParent actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPAltSvcTransactionParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PAltSvcTransactionConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, aConnInfo);
    // Sentinel = 'aConnInfo'
    (msg__)->WriteSentinel(284558204);
    WriteIPDLParam(msg__, this, aCaps);
    // Sentinel = 'aCaps'
    (msg__)->WriteSentinel(90964457);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

