adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_NotifyObserver", OTHER);

    bool sendok__ = ChannelSend(msg__);
    return sendok__;
}

auto PSocketProcessParent::SendPRemoteLazyInputStreamConstructor(
        PRemoteLazyInputStreamParent* actor,
        const nsID& aID,
        const uint64_t& aSize) -> PRemoteLazyInputStreamParent*
{
    if (!actor) {
        NS_WARNING("Cannot bind null PRemoteLazyInputStreamParent actor");
        return nullptr;
    }

    actor->SetManagerAndRegister(this);
    mManagedPRemoteLazyInputStreamParent.PutEntry(actor);


    // Build our constructor message.
    IPC::Message* msg__ = PSocketProcess::Msg_PRemoteLazyInputStreamConstructor(MSG_ROUTING_CONTROL);

    MOZ_RELEASE_ASSERT(actor, "NULL actor value passed to non-nullable param");
    WriteIPDLParam(msg__, this, actor);
    // Sentinel = 'actor'
    (msg__)->WriteSentinel(102892058);
    WriteIPDLParam(msg__, this, aID);
    // Sentinel = 'aID'
    (msg__)->WriteSentinel(33292527);
    WriteIPDLParam(msg__, this, aSize);
    // Sentinel = 'aSize'
    (msg__)->WriteSentinel(97124861);




    // Notify the other side about the newly created actor. This can
    // fail if our manager has already been destroyed.
    //
    // NOTE: If the send call fails due to toplevel channel teardown,
    // the `IProtocol::ChannelSend` wrapper absorbs the error for us,
    // so we don't tear down actors unexpectedly.

    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_PRemoteLazyInputStreamConstructor", OTHER);

    bool sendok__ = ChannelSend(msg__);


    // Warn, destroy the actor, and return null if the message failed to
    // send. Otherwise, return the successfully created actor reference.
    if (!sendok__) {
        NS_WARNING("Error sending PRemoteLazyInputStreamParent constructor");
        IProtocol* mgr = actor->Manager();
        actor->DestroySubtree(FailedConstructor);
        actor->ClearSubtree();
        mgr->RemoveManagee(PRemoteLazyInputStreamMsgStart, actor);

        return nullptr;
    }
    return actor;
}

auto PSocketProcessParent::SendGetSocketData(
        mozilla::ipc::ResolveCallback<SocketDataArgs>&& aResolve,
        mozilla::ipc::RejectCallback&& aReject) -> void
{
    IPC::Message* msg__ = PSocketProcess::Msg_GetSocketData(MSG_ROUTING_CONTROL);





    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetSocketData", OTHER);

    ChannelSend(msg__, std::move(aResolve), std::move(aReject));
    return;
}

auto PSocketProcessParent::SendGetSocketData() -> RefPtr<GetSocketDataPromise>
{
    RefPtr<MozPromise<SocketDataArgs, ResponseRejectReason, true>::Private> promise__ = new MozPromise<SocketDataArgs, ResponseRejectReason, true>::Private(__func__);
    promise__->UseDirectTaskDispatch(__func__);
    SendGetSocketData([promise__](SocketDataArgs&& aValue) {
        promise__->Resolve(std::move(aValue), __func__);
    }, [promise__](ResponseRejectReason&& aReason) {
        promise__->Reject(std::move(aReason), __func__);
    });
    return promise__;
}

auto PSocketProcessParent::SendGetDNSCacheEntries(
        mozilla::ipc::ResolveCallback<nsTArray<DNSCacheEntries>>&& aResolve,
        mozilla::ipc::RejectCallback&& aReject) -> void
{
    IPC::Message* msg__ = PSocketProcess::Msg_GetDNSCacheEntries(MSG_ROUTING_CONTROL);





    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetDNSCacheEntries", OTHER);

    ChannelSend(msg__, std::move(aResolve), std::move(aReject));
    return;
}

auto PSocketProcessParent::SendGetDNSCacheEntries() -> RefPtr<GetDNSCacheEntriesPromise>
{
    RefPtr<MozPromise<nsTArray<DNSCacheEntries>, ResponseRejectReason, true>::Private> promise__ = new MozPromise<nsTArray<DNSCacheEntries>, ResponseRejectReason, true>::Private(__func__);
    promise__->UseDirectTaskDispatch(__func__);
    SendGetDNSCacheEntries([promise__](nsTArray<DNSCacheEntries>&& aValue) {
        promise__->Resolve(std::move(aValue), __func__);
    }, [promise__](ResponseRejectReason&& aReason) {
        promise__->Reject(std::move(aReason), __func__);
    });
    return promise__;
}

auto PSocketProcessParent::SendGetHttpConnectionData(
        mozilla::ipc::ResolveCallback<nsTArray<HttpRetParams>>&& aResolve,
        mozilla::ipc::RejectCallback&& aReject) -> void
{
    IPC::Message* msg__ = PSocketProcess::Msg_GetHttpConnectionData(MSG_ROUTING_CONTROL);





    if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
        mozilla::ipc::LogMessageForProtocol(
            "PSocketProcessParent",
            OtherPid(),
            "Sending ",
            msg__->type(),
            mozilla::ipc::MessageDirection::eSending);
    }
    AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetHttpConnectionData", OTHER);

    ChannelSend(msg__, std::move(aResolve), std::move(aReject));
    return;
}

auto PSocketProcessParent::SendGetHttpConnectionData() -> RefPtr<GetHttpConnectionDataPromise>
{
    RefPtr<MozPromise<nsTArray<HttpRetParams>, ResponseRejectReason, true>::Private> promise__ = new MozPromise<nsTArray<HttpRetParams>, ResponseRejectReason, true>::Private(__func__);
    promise__->UseDirectTaskDispatch(__func__);
    SendGetHttpConnectionData([promise__](nsTArray<HttpRetParams>&& aValue) {
        promise__->Resolve(std::move(aValue), __func__);
    }, [promise__](ResponseRejectReason&& aReason) {
        promise__->Reject(std::move(aReason), __func__);
    });
    return promise__;
}

auto PSocketProcessParent::SendPFileDescriptorSetConstructor(const FileDescriptor& fd) -> PFileDescriptorSetParent*
{
    PFileDescriptorSetParent* actor = (static_cast<SocketProcessParent*>(this))->AllocPFileDescriptorSetParent(fd);
    return SendPFileDescriptorSetConstructor(actor, fd);
}

