adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
                callback->Resolve(std::move(aGeneration));
            } else {
                ResponseRejectReason reason__{};
                if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(reason__)))))) {
                    FatalError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                // Sentinel = 'reason__'
                if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 251855687)))) {
                    mozilla::ipc::SentinelReadError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                msg__.EndRead(iter__, msg__.type());

                callback->Reject(std::move(reason__));
            }
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PHttpTransactionConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PParentToChildStreamConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PHttpConnectionMgrConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PInputChannelThrottleQueueConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PAltSvcTransactionConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PTRRServiceConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PNativeDNSResolverOverrideConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_PRemoteLazyInputStreamConstructor__ID:
        {
            return MsgProcessed;
        }
    case PSocketProcess::Reply_GetSocketData__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessParent",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetSocketData", OTHER);

            PickleIterator iter__{msg__};
            bool resolve__ = false;
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(resolve__)))))) {
                FatalError("Error deserializing 'resolve__'");
                return MsgValueError;
            }
            // Sentinel = 'resolve__'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 322044863)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'resolve__'");
                return MsgValueError;
            }


            UniquePtr<MessageChannel::UntypedCallbackHolder> untypedCallback =
                GetIPCChannel()->PopCallback(msg__);

            typedef MessageChannel::CallbackHolder<SocketDataArgs> CallbackHolder;
            auto* callback = static_cast<CallbackHolder*>(untypedCallback.get());
            if (!callback) {
                FatalError("Error unknown callback");
                return MsgProcessingError;
            }

            if (resolve__) {
                SocketDataArgs data{};

                if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(data)))))) {
                    FatalError("Error deserializing 'SocketDataArgs'");
                    return MsgValueError;
                }
                // Sentinel = 'data'
                if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 67109275)))) {
                    mozilla::ipc::SentinelReadError("Error deserializing 'SocketDataArgs'");
                    return MsgValueError;
                }
                msg__.EndRead(iter__, msg__.type());

                callback->Resolve(std::move(data));
            } else {
                ResponseRejectReason reason__{};
                if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(reason__)))))) {
                    FatalError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                // Sentinel = 'reason__'
                if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 251855687)))) {
                    mozilla::ipc::SentinelReadError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                msg__.EndRead(iter__, msg__.type());

                callback->Reject(std::move(reason__));
            }
            return MsgProcessed;
        }
    case PSocketProcess::Reply_GetDNSCacheEntries__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessParent",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetDNSCacheEntries", OTHER);

            PickleIterator iter__{msg__};
            bool resolve__ = false;
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(resolve__)))))) {
                FatalError("Error deserializing 'resolve__'");
                return MsgValueError;
            }
            // Sentinel = 'resolve__'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 322044863)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'resolve__'");
                return MsgValueError;
            }


            UniquePtr<MessageChannel::UntypedCallbackHolder> untypedCallback =
                GetIPCChannel()->PopCallback(msg__);

            typedef MessageChannel::CallbackHolder<nsTArray<DNSCacheEntries>> CallbackHolder;
            auto* callback = static_cast<CallbackHolder*>(untypedCallback.get());
            if (!callback) {
                FatalError("Error unknown callback");
                return MsgProcessingError;
            }

            if (resolve__) {
                nsTArray<DNSCacheEntries> entries{};

                if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(entries)))))) {
                    FatalError("Error deserializing 'DNSCacheEntries[]'");
                    return MsgValueError;
                }
                // Sentinel = 'entries'
                if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 199361275)))) {
                    mozilla::ipc::SentinelReadError("Error deserializing 'DNSCacheEntries[]'");
                    return MsgValueError;
                }
                msg__.EndRead(iter__, msg__.type());

                callback->Resolve(std::move(entries));
            } else {
                ResponseRejectReason reason__{};
                if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(reason__)))))) {
                    FatalError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                // Sentinel = 'reason__'
                if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 251855687)))) {
                    mozilla::ipc::SentinelReadError("Error deserializing 'reason__'");
                    return MsgValueError;
                }
                msg__.EndRead(iter__, msg__.type());

