adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
            if ((!((static_cast<SocketProcessParent*>(this))->RecvPDNSRequestConstructor(actor, std::move(hostName), std::move(trrServer), std::move(type), std::move(originAttributes), std::move(flags))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            return MsgProcessed;
        }
    default:
        return MsgNotKnown;
    case SHMEM_CREATED_MESSAGE_TYPE:
        {
            FatalError("this protocol tree does not use shmem");
            return MsgNotKnown;
        }
    case SHMEM_DESTROYED_MESSAGE_TYPE:
        {
            FatalError("this protocol tree does not use shmem");
            return MsgNotKnown;
        }
    }
}

auto PSocketProcessParent::OnMessageReceived(
        const Message& msg__,
        Message*& reply__) -> PSocketProcessParent::Result
{
    int32_t route__ = msg__.routing_id();
    if (MSG_ROUTING_CONTROL != route__) {
        IProtocol* routed__ = Lookup(route__);
        if (!routed__ || !routed__->GetLifecycleProxy()) {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessParent",
                    OtherPid(),
                    "Ignored message for dead actor",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eSending);
            }

            return MsgProcessed;
        }

        RefPtr<mozilla::ipc::ActorLifecycleProxy> proxy__ =
            routed__->GetLifecycleProxy();
        return proxy__->Get()->OnMessageReceived(msg__, reply__);
    }

    switch (msg__.type()) {
    case PSocketProcess::Msg_GetTLSClientCert__ID:
        {
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessParent",
                    OtherPid(),
                    "Received ",
                    (&(msg__))->type(),
                    mozilla::ipc::MessageDirection::eReceiving);
            }
            AUTO_PROFILER_LABEL("PSocketProcess::Msg_GetTLSClientCert", OTHER);

            PickleIterator iter__{msg__};
            nsCString aHostName{};
            OriginAttributes aOriginAttributes{};
            int32_t aPort{};
            uint32_t aProviderFlags{};
            uint32_t aProviderTlsFlags{};
            ByteArray aServerCert{};
            mozilla::Maybe<ByteArray> aClientCert{};
            nsTArray<ByteArray> aCollectedCANames{};

            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aHostName)))))) {
                FatalError("Error deserializing 'nsCString'");
                return MsgValueError;
            }
            // Sentinel = 'aHostName'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 290128769)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'nsCString'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aOriginAttributes)))))) {
                FatalError("Error deserializing 'OriginAttributes'");
                return MsgValueError;
            }
            // Sentinel = 'aOriginAttributes'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 1021839089)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'OriginAttributes'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aPort)))))) {
                FatalError("Error deserializing 'int32_t'");
                return MsgValueError;
            }
            // Sentinel = 'aPort'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 97452551)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'int32_t'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aProviderFlags)))))) {
                FatalError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            // Sentinel = 'aProviderFlags'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 701957530)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aProviderTlsFlags)))))) {
                FatalError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            // Sentinel = 'aProviderTlsFlags'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 1025771213)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'uint32_t'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aServerCert)))))) {
                FatalError("Error deserializing 'ByteArray'");
                return MsgValueError;
            }
            // Sentinel = 'aServerCert'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 435553383)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aClientCert)))))) {
                FatalError("Error deserializing 'ByteArray?'");
                return MsgValueError;
            }
            // Sentinel = 'aClientCert'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 420873295)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray?'");
                return MsgValueError;
            }
            if ((!(ReadIPDLParam((&(msg__)), (&(iter__)), this, (&(aCollectedCANames)))))) {
                FatalError("Error deserializing 'ByteArray[]'");
                return MsgValueError;
            }
            // Sentinel = 'aCollectedCANames'
            if ((!(((&(msg__)))->ReadSentinel((&(iter__)), 967968361)))) {
                mozilla::ipc::SentinelReadError("Error deserializing 'ByteArray[]'");
                return MsgValueError;
            }
            msg__.EndRead(iter__, msg__.type());
            int32_t id__ = MSG_ROUTING_CONTROL;
            bool aSucceeded{};
            ByteArray aOutCert{};
            ByteArray aOutKey{};
            nsTArray<ByteArray> aBuiltChain{};
            if ((!((static_cast<SocketProcessParent*>(this))->RecvGetTLSClientCert(std::move(aHostName), std::move(aOriginAttributes), std::move(aPort), std::move(aProviderFlags), std::move(aProviderTlsFlags), std::move(aServerCert), std::move(aClientCert), std::move(aCollectedCANames), (&(aSucceeded)), (&(aOutCert)), (&(aOutKey)), (&(aBuiltChain)))))) {
                mozilla::ipc::ProtocolErrorBreakpoint("Handler returned error code!");
                // Error handled in mozilla::ipc::IPCResult
                return MsgProcessingError;
            }

            reply__ = PSocketProcess::Reply_GetTLSClientCert(id__);

            WriteIPDLParam(reply__, this, aSucceeded);
            // Sentinel = 'aSucceeded'
            (reply__)->WriteSentinel(357893095);
            WriteIPDLParam(reply__, this, aOutCert);
            // Sentinel = 'aOutCert'
            (reply__)->WriteSentinel(231605032);
            WriteIPDLParam(reply__, this, aOutKey);
            // Sentinel = 'aOutKey'
            (reply__)->WriteSentinel(180683459);
            WriteIPDLParam(reply__, this, aBuiltChain);
            // Sentinel = 'aBuiltChain'
            (reply__)->WriteSentinel(422380613);

