adi6409/browser-ff/src/obj-x86_64-pc-linux-gnu/ipc/ipdl/PSocketProcessParent.cpp
            if (mozilla::ipc::LoggingEnabledFor("PSocketProcessParent")) {
                mozilla::ipc::LogMessageForProtocol(
                    "PSocketProcessParent",
                    OtherPid(),
                    "Sending reply ",
                    reply__->type(),
                    mozilla::ipc::MessageDirection::eSending);
            }
            return MsgProcessed;
        }
    default:
        return MsgNotKnown;
    }
}

auto PSocketProcessParent::OnCallReceived(
        const Message& msg__,
        Message*& reply__) -> PSocketProcessParent::Result
{
    MOZ_ASSERT_UNREACHABLE("message protocol not supported");
    return MsgNotKnown;
}

auto PSocketProcessParent::OnChannelClose() -> void
{
    DestroySubtree(NormalShutdown);
    ClearSubtree();
    DeallocShmems();
    if (GetLifecycleProxy()) {
        GetLifecycleProxy()->Release();
    }
}

auto PSocketProcessParent::OnChannelError() -> void
{
    DestroySubtree(AbnormalShutdown);
    ClearSubtree();
    DeallocShmems();
    if (GetLifecycleProxy()) {
        GetLifecycleProxy()->Release();
    }
}

auto PSocketProcessParent::ClearSubtree() -> void
{
    for (auto it = mManagedPDNSRequestParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPDNSRequestParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPDNSRequestParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPDNSRequestParent.Clear();

    for (auto it = mManagedPWebrtcTCPSocketParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPWebrtcTCPSocketParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPWebrtcTCPSocketParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPWebrtcTCPSocketParent.Clear();

    for (auto it = mManagedPFileDescriptorSetParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPFileDescriptorSetParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPFileDescriptorSetParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPFileDescriptorSetParent.Clear();

    for (auto it = mManagedPHttpTransactionParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPHttpTransactionParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPHttpTransactionParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPHttpTransactionParent.Clear();

    for (auto it = mManagedPHttpConnectionMgrParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPHttpConnectionMgrParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPHttpConnectionMgrParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPHttpConnectionMgrParent.Clear();

    for (auto it = mManagedPChildToParentStreamParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPChildToParentStreamParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPChildToParentStreamParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPChildToParentStreamParent.Clear();

    for (auto it = mManagedPParentToChildStreamParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPParentToChildStreamParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPParentToChildStreamParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPParentToChildStreamParent.Clear();

    for (auto it = mManagedPInputChannelThrottleQueueParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPInputChannelThrottleQueueParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPInputChannelThrottleQueueParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPInputChannelThrottleQueueParent.Clear();

    for (auto it = mManagedPAltServiceParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPAltServiceParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPAltServiceParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPAltServiceParent.Clear();

    for (auto it = mManagedPAltSvcTransactionParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPAltSvcTransactionParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPAltSvcTransactionParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPAltSvcTransactionParent.Clear();

    for (auto it = mManagedPTRRServiceParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPTRRServiceParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPTRRServiceParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPTRRServiceParent.Clear();

    for (auto it = mManagedPProxyConfigLookupParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPProxyConfigLookupParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPProxyConfigLookupParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPProxyConfigLookupParent.Clear();

    for (auto it = mManagedPNativeDNSResolverOverrideParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPNativeDNSResolverOverrideParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPNativeDNSResolverOverrideParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPNativeDNSResolverOverrideParent.Clear();

    for (auto it = mManagedPRemoteLazyInputStreamParent.Iter(); !it.Done(); it.Next()) {
        it.Get()->GetKey()->ClearSubtree();
    }
    for (auto it = mManagedPRemoteLazyInputStreamParent.Iter(); !it.Done(); it.Next()) {
        // Recursively releasing mManagedPRemoteLazyInputStreamParent kids.
        auto* proxy = it.Get()->GetKey()->GetLifecycleProxy();
        NS_IF_RELEASE(proxy);
    }
    mManagedPRemoteLazyInputStreamParent.Clear();

}



} // namespace net
} // namespace mozilla
namespace mozilla {
namespace ipc {
auto IPDLParamTraits<mozilla::net::PSocketProcessParent*>::Write(
        IPC::Message* aMsg,
        mozilla::ipc::IProtocol* aActor,
        const paramType& aVar) -> void
{
    int32_t id;
    if (!aVar) {
        id = 0;  // kNullActorId
    } else {
        id = aVar->Id();
        if (id == 1) {  // kFreedActorId
            aVar->FatalError("Actor has been |delete|d");
        }
        MOZ_RELEASE_ASSERT(
            aActor->GetIPCChannel() == aVar->GetIPCChannel(),
            "Actor must be from the same channel as the"
            " actor it's being sent over");
        MOZ_RELEASE_ASSERT(
            aVar->CanSend(),
            "Actor must still be open when sending");
    }

    WriteIPDLParam(aMsg, aActor, id);
}

auto IPDLParamTraits<mozilla::net::PSocketProcessParent*>::Read(
        const IPC::Message* aMsg,
        PickleIterator* aIter,
        mozilla::ipc::IProtocol* aActor,
        paramType* aVar) -> bool
{
    mozilla::Maybe<mozilla::ipc::IProtocol*> actor =
        aActor->ReadActor(aMsg, aIter, true, "PSocketProcess", PSocketProcessMsgStart);
    if (actor.isNothing()) {
        return false;
    }

    *aVar = static_cast<mozilla::net::PSocketProcessParent*>(actor.value());
    return true;
}

} // namespace ipc
} // namespace mozilla
